Codeigniter/app/Controllers/Home.php

    public function listarAutomoveis() : string
    {
        $automoveis_model = new AutomoveisModel;

        $data['dados'] = $automoveis_model->findAll();
---
SELECT *
FROM `automoveis`